04_OpenFoam/_Tut_02/OpenFOAMTeaching/JozsefNagy/livestreams/01_First-tutorial/S1/elbow_refined/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication fluentMeshToFoam elbow.msh
runApplication $(getApplication)
runApplication foamMeshToFluent
runApplication foamDataToFluent

#------------------------------------------------------------------------------
